#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

OpenTofu
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Reading...
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Read complete after 1s

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.networks["dev_au"].konnect_cloud_gateway_network.cgw_network will be created
  + resource "konnect_cloud_gateway_network" "cgw_network" {
      + availability_zones                = [
          + "apse2-az1",
          + "apse2-az2",
          + "apse2-az3",
        ]
      + cidr_block                        = "10.10.0.0/16"
      + cloud_gateway_provider_account_id = "e7d54ffb-7bfc-442d-837f-d7cbe9920e4a"
      + configuration_reference_count     = (known after apply)
      + created_at                        = (known after apply)
      + ddos_protection                   = false
      + default                           = (known after apply)
      + entity_version                    = (known after apply)
      + firewall                          = {
          + allowed_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + denied_cidr_blocks  = (known after apply)
        }
      + id                                = (known after apply)
      + name                              = "dev_au"
      + provider_metadata                 = (known after apply)
      + region                            = "ap-southeast-2"
      + state                             = (known after apply)
      + transit_gateway_count             = (known after apply)
      + updated_at                        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ network_ids             = {
      + dev_au = {
          + id = (known after apply)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @liyangau, Action: `pull_request`*